

	var sido = new Array("서울특별시", "경기도", "인천광역시", "부산광역시", "대전광역시", "대구광역시",
			"광주광역시", "울산광역시", "강원도", "충청남도", "충청북도", "경상남도", "경상북도", "전라남도",
			"전라북도", "제주틍별자치도", "세종특별자치시");

	var sigungu1 = new Array("강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구",
			"금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구",
			"성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구");

	var sigungu2 = new Array("가평군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시",
			"김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시",
			"안양시", "양주시", "양평군", "여주시", "연천군", " 오산시", "용인시", "의왕시", "의정부시",
			"이천시", "파주시", "평택시", "포천시", "하남시", "화성시");

	var sigungu3 = new Array("강화군", "계양구", "남구", "남동구", "동구", "부평구", "서구",
			"연수구", "옹진군", "중구");
	var sigungu4 = new Array("강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구",
			"북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구");
	var sigungu5 = new Array("대덕구", "동구", "서구", "유성구", "중구");
	var sigungu6 = new Array("남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구");
	var sigungu7 = new Array("광산구", "남구", "동구", "북구", "서구");
	var sigungu8 = new Array("남구", "동구", "북구", "울주군", "중구");
	var sigungu9 = new Array("강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군",
			"영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시", "평창군", "홍천군",
			"화천군", "횡성군");
	var sigungu10 = new Array("공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시",
			"서천군", "아산시", "예산군", "천안시", "청양군", "태안군", "홍성군", "계룡시");
	var sigungu11 = new Array("괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시",
			"진천군", "청주시", "충주시", "증평군");
	var sigungu12 = new Array("거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시",
			"산청군", "양산시", "의령군", "진주시", "창녕군", "창원시", "통영시", "하동군", "함안군",
			"함양군", "합천군");
	var sigungu13 = new Array("경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시",
			"봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군",
			"울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시");
	var sigungu14 = new Array("강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군",
			"목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군",
			"장성군", "장흥군", "진도군", "함평군", "해남군", "화순군");
	var sigungu15 = new Array("고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군",
			"완주군", "익산시", "임실군", "장수군", "전주시", "정읍시", "진안군");
	var sigungu16 = new Array("서귀포시", "제주시");
	var sigungu17 = new Array("세종특별자치시");

	// 순서 강남구
	var dong1 = new Array("개포동", "논현동", "대치동", "도곡동", "삼성동", "세곡동", "수서동",
			"신사동", "압구정동", "역삼동", "율현동", "일원동", "자곡동", "청담동");

	var dong2 = new Array("강일동", "고덕동", "길동", "둔촌동", "명일동", "상일동", "성내동",
			"암사동", "천호동");
	var dong3 = new Array("미아동", "번동", "수유동", "우이동");
	var dong4 = new Array("가양동", "개화동", "공항동", "과해동", "내발산동", "등촌동", "마곡동",
			"방화동", "염창동", "오곡동", "오쇠동", "외발산동", "화곡동");
	var dong5 = new Array("남현동", "봉천동", "신림동");
	var dong6 = new Array("광장동", "구의동", "군자동", "능동", "자양동", "중곡동", "화양동");
	var dong7 = new Array("가리봉동", "개봉동", "고척동", "구로동", "궁동", "신도림동", "오류동",
			"온수동", "천왕동", "항동");
	var dong8 = new Array("가산동", "독산동", "시흥동");
	var dong9 = new Array("공릉동", "상계동", "월계동", "중계동", "하계동");
	var dong10 = new Array("도봉동", "방학동", "쌍문동", "창동");
	var dong11 = new Array("답십리동", "신설동", "용두동", "이문동", "장안동", "전농동", "제기동",
			"청량리동", "회기동", "휘경동");
	var dong12 = new Array("노량진동", "대방동", "동작동", "본동", "사당동", "상도동", "신대방동",
			"흑석동");

	var dong13 = new Array("공덕동", "구수동", "노고산동", "당인동", "대흥동", "도화동", "동교동",
			"마포동", "망원동", "상수동", "상암동", "서교동", "성산동", "신공덕동", "신수동", "신정동",
			"아현동", "연남동", "염리동", "용강동", "중동", "창전동", "토정동", "하중동", "합정동", "현석동");

	var dong14 = new Array("남가좌동", "냉천동", "대신동", "대현동", "미근동", "봉원동", "북가좌동",
			"북아현동", "신촌동", "연희동", "영천동", "옥천동", "창천동", "천연동", "충정로", "합동",
			"현저동", "홍은동", "홍제동");

	var dong15 = new Array("내곡동", "반포동", "방배동", "서초동", "신원동", "양재동", "염곡동",
			"우명동", "원지동", "잠원동");
	var dong16 = new Array("금호동", "도선동", "마장동", "사근동", "상왕십리동", "성수동", "송정동",
			"옥수동", "용답동", "응봉동", "하왕십리동", "행당동", "홍익동");
	var dong17 = new Array("길음동", "돈암동", "동선동", "동소문동", "보문동", "삼선동", "상월곡동",
			"석관동", "성북동", "안암동", "장위동", "정릉동", "종암동", "하월곡동");
	var dong18 = new Array("가락동", "거여동", "마천동", "문정동", "방이동", "삼전동", "석촌동",
			"송파동", "신천동", "오금동", "잠실동", "장지동", "풍납동");
	var dong19 = new Array("목동", "신월동", "신정동");
	var dong20 = new Array("당산동", "대림동", "도림동", "문래동", "신길동", "양평동", "양화동",
			"여의도동", "영등포동");
	var dong21 = new Array("갈월동", "남영동", "도원동", "동빙고동", "동자동", "문배동", "보광동",
			"산천동", "서계동", "서빙고동", "신계동", "신창동", "용문동", "용산동", "원효로", "이촌동",
			"이태원동", "주성동", "청암동", "청파동", "한강로", "한남동", "효창동", "후암동");

	var dong22 = new Array("갈현동", "구산동", "녹번동", "대조동", "불광동", "수색동", "신사동",
			"역촌동", "응암동", "증산동", "진관동");
	var dong23 = new Array("가회동", "견지동", "경운동", "계동", "공평동", "관수동", "관철동",
			"관훈동", "교남동", "교북동", "구기동", "궁정동", "권농동", "낙원동", "내수동", "내자동",
			"누상동", "누하동", "당주동", "도렴동", "돈의동", "동숭동", "명륜동", "묘동", "무악동",
			"봉익동", "부암동", "사간동", "사직동", "삼청동", "서린동", "세종로", "소격동", "송월동",
			"송현동", "수송동", "숭인동", "신교동", "신문로", "신영동", "안국동", "연건동", "연지동",
			"예지동", "옥인동");
	var dong24 = new Array("광희동", "남대문로", "남산동", "남창동", "남학동", "다동", "만리동",
			"명동", "무교동", "무학동", "묵정동", "방산동", "봉래동", "북창동", "산림동", "삼각동",
			"서소문동", "소공동", "수표동", "수하동", "순화동", "신당동", "쌍림동", "예관동", "예장동",
			"오장동", "을지로", "의주로", "인현동", "입정동", "장교동", "장충동", "저동", "정동", "주교동",
			"주자동", "중림동", "초동", "충무로", "충정로", "태평로", "필동", "황학동", "회현동", "흥인동");
	var dong25 = new Array("망우동", "면목동", "묵동", "상봉동", "신내동", "중화동");

	var gg1 = new Array("가평읍", "북면", "상면", "설악면", "조정면", "청평면");
	var gg2 = new Array("가좌동", "강매동", "고양동", "관산동", "구산동", "내곡동", "내유동", "대자동",
			"대장동", "대화동", "덕은동", "덕이동", "도내동", "동산동", "마두동", "문봉동", "백석동",
			"법곳동", "벽제동", "북한동", "사리현동", "산황동", "삼송동", "선유동", "설문동", "성사동",
			"성석동", "식사동", "신원동", "신평동", "오금동", "용두동", "원당동", "원흥동", "일산동",
			"장항동", "정발산동", "주교동", "주엽동", "중산동", "지영동", "지축동", "탄현동", "토당동",
			"풍동", "행신동", "행주내동", "행주외동", "향동동", "현천동", "화전동", "화정동", "효자동");
	var gg3 = new Array("갈현동", "과천동", "관문동", "막계동", "문원동", "별양동", "부림동", "원문동",
			"주암동", "중앙동");
	var gg4 = new Array("가학동", "광명동", "노온사동", "소하동", "옥길동", "일직동", "철산동", "하안동");
	var gg5 = new Array("경안동", "곤지암읍", "남종면", "남한산성면", "도척면", "목동", "목현동",
			"삼동", "송정동", "쌍령동", "역동", "오포읍", "장지동", "중대동", "직동", "초월읍", "탄벌동",
			"태전동", "퇴촌면", "회덕동");
	var gg6 = new Array("갈매동", "교문동", "사노동", "수택동", "아천동", "인창동", "토평동");
	var gg7 = new Array("금정동", "당동", "당정동", "대야미동", "도마교동", "둔대동", "부곡동",
			"산본동", "속달동");
	var gg8 = new Array("감정동", "걸포동", "고촌읍", "구래동", "대곶면", "마산동", "북변동", "사우동",
			"양촌읍", "운양동", "월곶면", "장기동", "통진읍", "풍무동", "하성면");
	var gg9 = new Array("금곡동", "다산동", "도농동", "별내동", "별내면", "삼패동", "수동면", "수석동",
			"오남읍", "와부읍", "이패동", "일패동", "조안면", "지금동", "진건읍", "진접읍", "퇴계원면",
			"평내동", "호평동", "화도읍");
	var gg10 = new Array("걸산동", "광암동", "동두천동", "보산동", "상봉암동", "상패동", "생연동",
			"송내동", "안흥동", "지행동", "탑동동", "하봉암동");
	var gg11 = new Array("계수동", "고강동", "괴안동", "내동", "대장동", "도당동", "범박동", "삼정동",
			"상동", "소사동", "소사본동", "송내동", "심곡동", "심곡본동", "약대동", "여월동", "역곡동",
			"오정동", "옥길동", "원미동", "원종동", "작동", "중동", "춘의동");

	var gg12 = new Array("갈현동", "고등동", "구미동", "궁내동", "금곡동", "금광동", "금토동",
			"단대동", "대장동", "도촌동", "동원동", "둔전동", "백현동", "복정동", "분당동", "사송동",
			"산성동", "삼평동", "상대원동", "상적동", "서현동", "석운동", "성남동", "수내동", "수진동",
			"시흥동", "신촌동", "신흥동", "심곡동", "야탑동", "양지동", "여수동", "오야동", "운중동",
			"율동", "은행동", "이매동", "정자동", "중동", "중앙동", "창곡동", "태평동", "판교동",
			"하대원동", "하산운동");
	var gg13 = new Array("고등동", "고색동", "곡반정동", "교동", "구운동", "구천동", "권선동",
			"금곡동", "남수동", "남창동", "당수동", "대황교동", "망포동", "매교동", "매산로", "매탄동",
			"매향동", "북수동", "상광교동", "서둔동", "세류동", "송죽동", "신동", "신풍동", "연무동",
			"영동", "영통동", "영화동", "오목천동", "우만동", "원천동", "율전동", "이목동", "이의동",
			"인계동", "입북동", "장안동", "장지동", "정자동", "조원동", "중동", "지동", "천천동", "탑동",
			"파장동", "팔달로", "평동", "평리동", "하광교동", "하동", "호매실동", "화서동");
	var gg14 = new Array("거모동", "계수동", "과림동", "광석동", "군자동", "금이동", "논곡동",
			"능곡동", "대야동", "도창동", "매화동", "목감동", "무지내동", "물왕동", "미산동", "방산동",
			"산현동", "신천동", "안현동", "월곶동", "은행동", "장곡동", "장현동", "정왕동", "조남동",
			"죽율동", "포동", "하상동", "하중동", "화정동");
	var gg15 = new Array("건건동", "고잔동", "대부남동", "대부동동", "대부북동", "목내동", "본오동",
			"부곡동", "사동", "사사동", "선감동", "선부동", "성곡동", "성포동", "수암동", "신길동",
			"양상동", "와동", "원곡동", "원시동", "월피동", "이동", "일동", "장상동", "장하동", "초지동",
			"팔곡이동", "팔곡일동", "풍도동", "화정동");
	var gg16 = new Array("가사동", "가현동", "계동", "고삼면", "공도읍", "구포동", "금광면", "금산동",
			"금석동", "낙원동", "당왕동", "대덕면", "대천동", "도기동", "동본동", "명륜동", "미양면",
			"발화동", "보개면", "봉남동", "봉산동", "사곡동", "삼죽면", "서운면", "서인동", "석정동",
			"성남동", "숭인동", "신건지동", "신모산동", "신소현동", "신흥동", "아양동", "양성면", "연지동",
			"영동", "옥산동", "옥천동", "원곡면", "인지동", "일죽면", "죽산면", "중리동", "창전동", "현수동");

	var gg17 = new Array("관양동", "박달동", "비산동", "석수동", "안양동", "평촌동", "호계동");
	var gg18 = new Array("고암동", "고읍동", "광사동", "광적면", "남면", "남방동", "덕계동", "덕정동",
			"마전동", "만송동", "백석읍", "봉양동", "산북동", "삼숭동", "어둔동", "옥정동", "유양동",
			"율정동", "은현면", "장흥면", "회암동", "회정동");
	var gg19 = new Array("강상면", "강하면", "개군면", "단월면", "서종면", "양동면", "양서면",
			"양평읍", "옥천면", "용문면", "지평면", "청운면");
	var gg20 = new Array("가남읍", "가업동", "강천면", "교동", "금사면", "능서면", "능현동", "단현동",
			"대신면", "매룡동", "멱곡동", "북내면", "산북면", "삼교동", "상거동", "상동", "신진동",
			"연라동", "연양동", "오금동", "오학동", "우만동", "월송동", "점동면", "점봉동", "창동",
			"천송동", "하거동", "하동", "현암동", "홍문동", "흥천면");
	var gg21 = new Array("군남면", "미산면", "백학면", "신서면", "연천읍", "왕징면", "장남면",
			"전곡읍", "중면", "청산면");
	var gg22 = new Array("가수동", "가장동", "갈곶동", "고현동", "궐동", "금암동", "내삼미동",
			"누읍동", "두곡동", "벌음동", "부산동", "서동", "서랑동", "세교동", "수청동", "양산동",
			"오산동", "외삼미동", "원동", "은계동", "지곶동", "청학동", "청호동", "탑동");
	var gg23 = new Array("고기동", "고림동", "고매동", "공세동", "구갈동", "김량장동", "남동",
			"남사면", "농서동", "동백동", "동천동", "마북동", "마평동", "모현읍", "백암면", "보라동",
			"보정동", "삼가동", "상갈동", "상하동", "상현동", "서천동", "성복동", "신갈동", "신봉동",
			"양지면", "언남동", "역북동", "영덕동", "운학동", "원삼면", "유방동", "이동읍", "죽전동",
			"중동", "지곡동", "청덕동", "포곡읍", "풍덕천동", "하갈동", "해곡동", "호동");

	var gg24 = new Array("고천동", "내손동", "삼동", "오전동", "왕곡동", "월암동", "이동", "청계동",
			"초평동", "포일동", "학의동");
	var gg25 = new Array("가능동", "고산동", "금오동", "낙양동", "녹양동", "민락동", "산곡동",
			"신곡동", "용현동", "의정부동", "자일동", "장암동", "호원동");
	var gg26 = new Array("갈산동", "고담동", "관고동", "단월동", "대월면", "대포동", "마장면",
			"모가면", "백사면", "부발읍", "사음동", "설성면", "송정동", "신둔면", "안흥동", "율면",
			"율현동", "장록동", "장호원읍", "중리동", "증일동", "증포동", "진리동", "창전동", "호법면");
	var gg27 = new Array("검산동", "광탄면", "교하동", "군내면", "금릉동", "금촌동", "다율동",
			"당하동", "동패동", "맥금동", "목동동", "문발동", "문산읍", "법원읍", "산남동", "상지석동",
			"서패동", "송촌동", "신촌동", "아동동", "야당동", "야동동", "연다산동", "오도동", "와동동",
			"월롱면", "장단면", "적성면", "조리읍", "진동면", "진서면", "탄현면", "파주읍", "파평면",
			"하지석동");
	var gg28 = new Array("가재동", "고덕면", "군문동", "도일동", "독곡동", "동삭동", "모곡동",
			"비전동", "서정동", "서탄면", "세교동", "소사동", "신대동", "신장동", "안중읍", "오성면",
			"용이동", "월곡동", "유천동", "이충동", "장당동", "장안동", "죽백동", "지산동", "지제동",
			"진위면", "청룡동", "청북읍", "칠괴동", "칠원동", "통복동", "팽성읍", "평택동", "포승읍",
			"합정동", "현덕면");
	var gg29 = new Array("가산면", "관인면", "군내면", "내촌면", "동교동", "선단동", "설운동",
			"소흘읍", "신북면", "신읍동", "어룡동", "영북면", "영중면", "이동면", "일동면", "자작동",
			"창수면", "화현면");
	var gg30 = new Array("감북동", "감이동", "감일동", "광암동", "교산동", "당정동", "덕풍동",
			"망월동", "미사동", "배알미동", "상사창동", "상산곡동", "선동", "신장동", "창우동", "천현동",
			"초이동", "초일동", "춘궁동", "풍산동", "하사창동", "하산곡동", "학암동", "항동");

	var gg31 = new Array("금곡동", "기산동", "기안동", "남양읍", "능동", "마도면", "매송면", "목동",
			"반송동", "반월동", "반정동", "방교동", "배양동", "병점동", "봉담읍", "비봉면", "산척동",
			"새솔동", "서신면", "석우동", "송동", "송산동", "송산면", "신동", "안녕동", "양감면", "영천동",
			"오산동", "우정읍", "장안면", "장지동", "정남면", "중동", "진안동", "청계동", "팔탄면",
			"향남읍", "황계동");

	var sigungu = new Array(sigungu1, sigungu2, sigungu3, sigungu4, sigungu5,
			sigungu6, sigungu7, sigungu8, sigungu9, sigungu10, sigungu11,
			sigungu12, sigungu13, sigungu14, sigungu15, sigungu16, sigungu17);
	console.log(sigungu);

	var dong = new Array(dong1, dong2, dong3, dong4, dong5, dong6, dong7,
			dong8, dong9, dong10, dong11, dong12, dong13, dong14, dong15,
			dong16, dong17, dong18, dong19, dong20, dong21, dong22, dong23,
			dong24, dong25);

	var gg = new Array(gg1, gg2, gg3, gg4, gg5, gg6, gg7, gg8, gg9, gg10, gg11,
			gg12, gg13, gg14, gg15, gg16, gg17, gg18, gg19, gg20, gg21, gg22,
			gg23, gg24, gg25, gg26, gg27, gg28, gg29, gg30, gg31);

	var donghap = new Array(dong, gg);

	
	
	$(function(){
	
	
	
	$(".select1").change(function() {
		$('#sel1').val($('.select1 option:selected').text());
		
		var selectVal = $('.select1').val();
		var inner = "";
		var inner2 = "";

		inner += "<option value=''>";
		inner += "시/군/구";
		inner += "</option>";

		inner2 += "<option value=''>";
		inner2 += "읍/면/동";
		inner2 += "</option>";

		for (var i = 0; i < sigungu[selectVal].length; i++) {
			console.log(sigungu[selectVal][i]);
			inner += "<option value=" + i + ">";
			inner += sigungu[selectVal][i];
			inner += "</option>";

		}
		$('.select2 option').remove();
		$('.select2').append(inner);
		$('.select3 option').remove();
		$('.select3').append(inner2);
	});

	
	
	$('.select2').change(function() {
		$('#sel2').val($('.select2 option:selected').text());
		
		var inner3 = "";
		inner3 += "<option value=''>";
		inner3 += "읍/면/동";
		inner3 += "</option>";
		

		
		var selectVal1 = $('.select1').val();
		var selectVal2 = $('.select2').val();
		for (var i = 0; i < donghap[selectVal1][selectVal2].length; i++) {
			inner3 += "<option value=" + i + ">";
			inner3 += donghap[selectVal1][selectVal2][i];
			inner3 += "</option>"
		}
		
		$('.select3 option').remove();
		$('.select3').append(inner3);
		
		
	
	});
	
	$('.select3').change(function() {
		$('#sel3').val($('.select3 option:selected').text());
	});
})
